Revit 2027 API
FabricationNetworkChangeService.ApplyChange Method
 Applies the previously set changes to the selection of fabrication parts to change the size, change the service, or both.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricationNetworkChangeServiceResult ApplyChange()
Public Function ApplyChange As FabricationNetworkChangeServiceResult
public:
FabricationNetworkChangeServiceResult ApplyChange()
member ApplyChange : unit -> FabricationNetworkChangeServiceResult
Return Value
FabricationNetworkChangeServiceResult
Exceptions
Exception | Condition
ArgumentException |  The selection contains invalid elements to change.
InvalidOperationException |  No fabrication configuration is loaded.
Remarks
 After this method has been invoked, call:
GetStraightsThatWereNotChanged() to get a set of fabrication part straight element identifiers that were not changed.
GetElementsThatFailed() to get a set of fabrication part element identifiers that had failures.
See Also
Reference
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace